numbers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
numbers[2:5] = [20, 30, 40]
print(numbers) # [0, 1, 20, 30, 40, 5, 6, 7, 8, 9, 10]

numbers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
numbers[2:5] = [20, 30, 40, 50]
print(numbers) # [0, 1, 20, 30, 40, 50, 5, 6, 7, 8, 9, 10]

numbers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
numbers[2:6] = [20, 30, 40]
print(numbers) # [0, 1, 20, 30, 40, 6, 7, 8, 9, 10]

"""
    리스트의 슬라이싱 연산을 통한 대입은, 슬라이싱한 영역을 일단 지우고,
    대입할 원소들을 Insert한다.
"""

numbers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
numbers[2:5:1] = [20, 30, 40, 50]
print(numbers) # [0, 1, 20, 30, 40, 50, 5, 6, 7, 8, 9, 10]

numbers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
numbers[2:5:2] = [20, 30, 40, 50]
print(numbers) # [증가폭이 주어지면, 들어갈 자리가 명확해지므로 엄격하게 개수를 체크한다.]